[
    {
        "year": "2025",
        "title": "Automated Portfolio Deployment on AWS S3",
        "image": "/assets/images/projects/portfolio.png",
        "description": "In this ongoing project, I aim to make the most of my newly gained IaC and cloud knowledge by automating the creation of an AWS infrastructure capable of hosting this portfolio. This will not only allow me to gain hands on experience with Terraform, but AWS as well, as access policies and other configuration of AWS resources will need to be written and tested.",
        "link": "https://github.com/IkramKo/cloud_resume",
        "buttonMessage": "VIEW SOURCE CODE"
    },
    {
        "year": "2024",
        "title": "Simulation of a Cyberattack on a Water Treatment Station",
        "image": "/assets/images/projects/simulation.png",
        "description": "This project aimed to simulate a water treatment plant's MQTT network using tools like Docker. My teammate and I simulated the sensors and other components and used Grafana to visualize sensor data (as seen in the image). I was in charge of, among other things, developing the control loops of the PLC that managed the various sensors and actuators of the testbed (Python), as well as creating and applying a playbook for an attack on the testbed. To do so, I leveraged tools like Metasploit and Wireshark to inject fake data into the network and generate unexpected behavior in the plant.",
        "link": "https://github.com/IkramKo/INF6103_Final_Project",
        "buttonMessage": "VIEW SOURCE CODE"
    },
    {
        "year": "2024",
        "title": "Hackathon Project - Vertigrow",
        "image": "/assets/images/projects/vertigrow.jpeg",
        "description": "During this 24h hackathon of which the subject was 'Sustainability', a friend and I designed a mini-game to introduce children to the world of aquaponics. I mainly designed and developed the gameplay (Godot, GDScript) and participated in the re-design of artistic components generated by an AI (GPT4).",
        "link": "https://github.com/IkramKo/vertigrow/",
        "buttonMessage": "VIEW SOURCE CODE"
    },
    {
        "year": "2023",
        "title": "EstebERP",
        "image": "/assets/images/projects/esteberp.png",
        "description": "In this project, we once again worked in a team of 6 in order to build a responsive internal management web app for a university club (Poly Esteban). The app allows the club to manage their financial and material ressources, as well as their personnel. I have worked on the UI/UX design of the website using Figma. As for the features, I have worked on the user authentification, the access control, the sponsors and personnel management and much more! I have also taken care of the project's documentation, be it by documenting my features, filming tutorials on how to use the app, and writing documentation for future developers on how to install and run the project.",
        "link": "",
        "buttonMessage": "NO LINK AVAILABLE"
    },
    {
        "year": "2023",
        "title": "Hackathon Project - iStoodi",
        "image": "/assets/images/projects/istoodi.png",
        "description": "This was a fun project done with a friend during a 24h hackathon. The subject was 'Maslow's Hierarchy of needs', and my friend and I had been assigned self-actualization as a subject. For that need, we made an app that generates text summaries as well as flashcards from text/pdf/video files. The goal was to make an app to help with one's desire to learn and to become the best version of themselves, thus fullfilling their need for self-actualization. We won 2nd place for that category!",
        "link": "https://github.com/IkramKo/stoodi",
        "buttonMessage": "VIEW SOURCE CODE"
    },
    {
        "year": "2022",
        "title": "Pixas",
        "image": "/assets/images/projects/pixas.png",
        "description": "In this project we worked in a team of 5 in order to build a collaborative drawing app. Two of us worked on the desktop client, and the other three (including me) worked on the mobile client using the Flutter framework. The app allows the users to draw alone or in groups of 4, and to showcase their drawings in their timeline, for all their friends to see and comment on. Users can all chat with each other in direct messages, or in group chats! I worked on several features of the app, but mainly the collaborative drawing, the drawing tools, and the authentification. I was also in charge of making sure that the UI was consistent across the different modules of the application.",
        "link": "",
        "buttonMessage": "NO LINK AVAILABLE"
    },
    {
        "year": "2022",
        "title": "Portfolio Project",
        "image": "/assets/images/projects/portfolio.png",
        "description": "This is a personal project I decided to work on in order to showcase my projects, as well as practice the angular skills I have acquired during the Web Application project.",
        "link": "https://github.com/IkramKo/IkramKo.github.io",
        "buttonMessage": "VIEW SOURCE CODE"
    },
    {
        "year": "2021",
        "title": "Web Application Project",
        "image": "/assets/images/projects/scrabble.jpg",
        "description": "In this project, we worked in teams of 6 in order to build a Scrabble web application. The user can play against a virtual player in two difficulties: beginner and expert, or in multiplayer against friends. Two modes are available: classic, and LOG2990, which introduces the concept of challenges. I have worked on the UI/UX design of the website, the scoreboard database, the waiting rooms system as well as the player actions. I have also taken on the role of manager as well. It is important to me that the team holds regular meetings so that everyone is aware of the project's progress.",
        "link": "https://scrabble.one/",
        "buttonMessage": "PLAY THE GAME!"
    }
]